chgpalmer/zephyr-hal-artery/include/dt-bindings/pinctrl/at32f403avgt7-pinctrl.h
#include "at32f403a_407-iomux.h"

#define USART1_TX_PA9 \
	AT32_PINMUX_AFIO('A', 9, ALTERNATE, USART1_GMUX_0000)

#define USART1_RX_PA10 \
	AT32_PINMUX_AFIO('A', 10, GPIO_IN, USART1_GMUX_0000)

#define USART2_TX_PA2 \
	AT32_PINMUX_AFIO('A', 2, ALTERNATE, USART2_GMUX_0000)
#define USART2_TX_PD5 \
	AT32_PINMUX_AFIO('D', 5, ALTERNATE, USART2_GMUX_0001)

#define USART2_RX_PA3 \
	AT32_PINMUX_AFIO('A', 3, GPIO_IN, USART2_GMUX_0000)
#define USART2_RX_PD6 \
	AT32_PINMUX_AFIO('D', 6, GPIO_IN, USART2_GMUX_0001)

#define USART3_TX_PB10 \
	AT32_PINMUX_AFIO('B', 10, ALTERNATE, USART3_GMUX_0000)

#define USART3_TX_PD8 \
	AT32_PINMUX_AFIO('D', 8, ALTERNATE, USART3_GMUX_0011)

#define USART3_RX_PB11 \
	AT32_PINMUX_AFIO('B', 11, GPIO_IN, USART3_GMUX_0000)

#define USART3_RX_PD9 \
	AT32_PINMUX_AFIO('D', 9, GPIO_IN, USART3_GMUX_0011)

#define UART4_TX_PC10 \
	AT32_PINMUX_AFIO('C', 10, ALTERNATE, UART4_GMUX_0000)

#define UART4_RX_PC11 \
	AT32_PINMUX_AFIO('C', 11, GPIO_IN, UART4_GMUX_0000)

#define UART5_TX_PC12 \
	AT32_PINMUX_AFIO('C', 12, ALTERNATE, UART5_GMUX_0000)

#define UART5_RX_PD2 \
	AT32_PINMUX_AFIO('D', 2, GPIO_IN, UART5_GMUX_0000)

#define USART6_TX_PC6 \
	AT32_PINMUX_AFIO('C', 6, ALTERNATE, USART6_GMUX_0000)

#define USART6_RX_PC7 \
	AT32_PINMUX_AFIO('C', 7, GPIO_IN, USART6_GMUX_0000)

#define UART7_TX_PE8 \
	AT32_PINMUX_AFIO('E', 8, ALTERNATE, UART7_GMUX_0000)

#define UART7_RX_PE7 \
	AT32_PINMUX_AFIO('E', 7, GPIO_IN, UART7_GMUX_0000)

#define UART8_TX_PE1 \
	AT32_PINMUX_AFIO('E', 1, ALTERNATE, UART8_GMUX_0000)

#define UART8_RX_PE0 \
	AT32_PINMUX_AFIO('E', 0, GPIO_IN, UART8_GMUX_0000)

#define SPI1_CS_PA4 \
	AT32_PINMUX_AFIO('A', 4, ALTERNATE, SPI1_GMUX_0000)

#define SPI1_SCK_PA5 \
	AT32_PINMUX_AFIO('A', 5, ALTERNATE, SPI1_GMUX_0000)

#define SPI1_MISO_PA6 \
	AT32_PINMUX_AFIO('A', 6, GPIO_IN, SPI1_GMUX_0000)

#define SPI1_MOSI_PA7 \
	AT32_PINMUX_AFIO('A', 7, ALTERNATE, SPI1_GMUX_0000)

#define SPI2_CS_PB12 \
	AT32_PINMUX_AFIO('B', 12, ALTERNATE, SPI2_GMUX_0000)

#define SPI2_SCK_PB13 \
	AT32_PINMUX_AFIO('B', 13, ALTERNATE, SPI2_GMUX_0000)

#define SPI2_MISO_PB14 \
	AT32_PINMUX_AFIO('B', 14, GPIO_IN, SPI2_GMUX_0000)

#define SPI2_MOSI_PB15 \
	AT32_PINMUX_AFIO('B', 15, ALTERNATE, SPI2_GMUX_0000)

#define SPI2_MCK_PC6 \
	AT32_PINMUX_AFIO('C', 6, ALTERNATE, SPI2_GMUX_0000)

#define SPI4_CS_PB6 \
	AT32_PINMUX_AFIO('B', 6, ALTERNATE, SPI4_GMUX_0010)

#define SPI4_CS_PE12 \
	AT32_PINMUX_AFIO('E', 12, ALTERNATE, SPI4_GMUX_0001)

#define SPI4_SCK_PB7 \
	AT32_PINMUX_AFIO('B', 7, ALTERNATE, SPI4_GMUX_0010)

#define SPI4_SCK_PE11 \
	AT32_PINMUX_AFIO('E', 11, ALTERNATE, SPI4_GMUX_0001)

#define SPI4_MISO_PB8 \
	AT32_PINMUX_AFIO('B', 8, GPIO_IN, SPI4_GMUX_0010)

#define SPI4_MISO_PE13 \
	AT32_PINMUX_AFIO('E', 13, GPIO_IN, SPI4_GMUX_0001)

#define SPI4_MOSI_PB9 \
	AT32_PINMUX_AFIO('B', 9, ALTERNATE, SPI4_GMUX_0010)

#define SPI4_MOSI_PE14 \
	AT32_PINMUX_AFIO('E', 14, ALTERNATE, SPI4_GMUX_0001)

#define SPI4_MCK_PC8 \
	AT32_PINMUX_AFIO('C', 8, ALTERNATE, SPI4_GMUX_0010)

#define I2C1_SCL_PB6 \
	AT32_PINMUX_AFIO('B', 6, ALTERNATE, I2C1_GMUX_0000)

#define I2C1_SDA_PB7 \
	AT32_PINMUX_AFIO('B', 7, ALTERNATE, I2C1_GMUX_0000)
